Lab9_php_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%death march%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%death march%' ESCAPE '!'
---
    public function admin_index()
   {
      $title = 'Daftar Artikel';
      $q = $this->request->getVar('q') ?? '';
      $model = new ArtikelModel();
      $data = [
          'title'   => $title,
          'q'       => $q,
          'artikel' => $model->like('judul', $q)->paginate(10, 'bootstrap'), #data dibatasi 4 record perhalaman